# CannotPlaceRailingOnStringerWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotPlaceRailingOnStringerWarning Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Railing is placed on tread because there is no stringer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPlaceRailingOnStringerWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPlaceRailingOnStringerWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPlaceRailingOnStringerWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace